# Load the Rails application.
require_relative 'application'

# Initialize the Rails application.
Rails.application.initialize!

GRADE_CORRESPONDENCE = [['10級', 1], ['9級', 2],['8級', 3], ['7級', 4],['6級', 5], ['5級', 6],['4級', 7], ['3級', 8],['2級', 9], ['1級', 10],['初段', 11], ['二段', 12],['三段', 13], ['四段', 14],['五段', 15], ['六段', 16]] 
# 以下は表記ゆれ対策のため。なお、数字の全角半角については一律に半角に置換することで対応する。
GRADE_QDver = {1=>"10Q", 2=>"9Q", 3=>"8Q", 4=>"7Q", 5=>"6Q", 6=>"5Q", 7=>"4Q", 8=>"3Q", 9=>"2Q", 10=>"1Q", 11=>"1D", 12=>"2D", 13=>"3D", 14=>"4D", 15=>"5D", 16=>"6D"}
GRADE_chara = {1=>"十級", 2=>"九級", 3=>"八級", 4=>"七級", 5=>"六級", 6=>"五級", 7=>"四級", 8=>"三級", 9=>"二級", 10=>"一級", 11=>"1段", 12=>"2段", 13=>"3段", 14=>"4段", 15=>"5段", 16=>"6段"}