# Load the Rails application.
require_relative 'application'

# Initialize the Rails application.
Rails.application.initialize!

GRADE_CORRESPONDENCE = [['10級', 1], ['9級', 2],['8級', 3], ['7級', 4],['6級', 5], ['5級', 6],['4級', 7], ['3級', 8],['2級', 9], ['1級', 10],['初段', 11], ['二段', 12],['三段', 13], ['四段', 14],['五段', 15], ['六段', 16]] 
# 以下は表記ゆれ対策のため。なお、数字の全角半角については一律に半角に置換することで対応する。
GRADE_QDver = {1=>"10q", 2=>"9q", 3=>"8q", 4=>"7q", 5=>"6q", 6=>"5q", 7=>"4q", 8=>"3q", 9=>"2q", 10=>"1q", 11=>"1d", 12=>"2d", 13=>"3d", 14=>"4d", 15=>"5d", 16=>"6d"}
GRADE_chara = {1=>"十級", 2=>"九級", 3=>"八級", 4=>"七級", 5=>"六級", 6=>"五級", 7=>"四級", 8=>"三級", 9=>"二級", 10=>"一級", 11=>"1段", 12=>"2段", 13=>"3段", 14=>"4段", 15=>"5段", 16=>"6段"}